#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_cloud_run_v2_service.my-service: Refreshing state... [id=projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.my-service is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "my-service" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2025-04-10T08:21:56.902420Z"
              - message              = <<-EOT
                    Revision 'cloud-run-cicd-service-00001-bvz' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=domestic-stock-checker-456208&resource=cloud_run_revision/service_name/cloud-run-cicd-service/revision_name/cloud-run-cicd-service-00001-bvz&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cloud-run-cicd-service%22%0Aresource.labels.revision_name%3D%22cloud-run-cicd-service-00001-bvz%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2025-04-10T08:21:56.896030Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=domestic-stock-checker-456208&resource=cloud_run_revision/service_name/cloud-run-cicd-service/revision_name/cloud-run-cicd-service-00001-bvz&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cloud-run-cicd-service%22%0Aresource.labels.revision_name%3D%22cloud-run-cicd-service-00001-bvz%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
                # (4 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2025-04-10T08:17:47.976731Z" -> (known after apply)
      ~ creator                 = "build-service-account-id@domestic-stock-checker-456208.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"CKv93b8GEPj23tED/cHJvamVjdHMvZG9tZXN0aWMtc3RvY2stY2hlY2tlci00NTYyMDgvbG9jYXRpb25zL2FzaWEtbm9ydGhlYXN0MS9zZXJ2aWNlcy9jbG91ZC1ydW4tY2ljZC1zZXJ2aWNl\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "build-service-account-id@domestic-stock-checker-456208.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service/revisions/cloud-run-cicd-service-00001-bvz" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "cloud-run-cicd-service"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2025-04-10T08:21:56.902420Z"
              - message              = <<-EOT
                    Revision 'cloud-run-cicd-service-00001-bvz' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=domestic-stock-checker-456208&resource=cloud_run_revision/service_name/cloud-run-cicd-service/revision_name/cloud-run-cicd-service-00001-bvz&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cloud-run-cicd-service%22%0Aresource.labels.revision_name%3D%22cloud-run-cicd-service-00001-bvz%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "7f6bda95-ac80-432f-bf87-0a270f8ebde8" -> (known after apply)
      ~ update_time             = "2025-04-10T08:17:47.976731Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://cloud-run-cicd-service-450893770312.asia-northeast1.run.app",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              ~ image          = "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/web:8df75163211abe5793a9688b019c2cff8b5b0a0a" -> "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/web:5b9146432664171fd6869bd84b0c2a0def9fb115"
                name           = "web"
                # (3 unchanged attributes hidden)

              ~ ports {
                  ~ name           = "http1" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ resources (known after apply)
              - resources {
                  - cpu_idle          = true -> null
                  - limits            = {
                      - "cpu"    = "1000m"
                      - "memory" = "512Mi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

                # (1 unchanged block hidden)
            }
          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              - depends_on     = [] -> null
              ~ image          = "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/api:8df75163211abe5793a9688b019c2cff8b5b0a0a" -> "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/api:5b9146432664171fd6869bd84b0c2a0def9fb115"
                name           = "app"
                # (2 unchanged attributes hidden)

              ~ ports (known after apply)

              ~ resources (known after apply)
              - resources {
                  - cpu_idle          = true -> null
                  - limits            = {
                      - "cpu"    = "1000m"
                      - "memory" = "256Mi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_cloud_run_v2_service_iam_binding.my-service-invoker-binding will be created
  + resource "google_cloud_run_v2_service_iam_binding" "my-service-invoker-binding" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + members  = [
          + "allUsers",
        ]
      + name     = "cloud-run-cicd-service"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Kubbo0308, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*